---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InvalidPathArgumentException
source: html/2b5d011c-a210-ad08-0ab4-9b17b79f5b88.htm
---
# InvalidPathArgumentException Members

Retrieves data needed to serialize the target object.